performance/try/ProductManagementSuite/login-Combined-JMeter-and-Selenium (1).yaml

# Script generated by Blazemeter Chrome Extension

modules:
  nose:
    ignore-unknown-actions: true

execution:
- executor: selenium
  scenario: login-Selenium
  
  capabilities: 
    browserName: chrome
  hold-for: 20m

- executor: jmeter
  scenario: login-Http
  concurrency: 20
  ramp-up: 1m
  hold-for: 19m

scenarios:
  login-Selenium:
    generate-flow-markers: true 
    headless: false
    timeout: 60s
    think-time: 0s
    requests:
    - label: Test
      actions:
      - resizeWindow(838,451)
      - go(https://www.saucedemo.com/inventory.html)
      - clickByID(add-to-cart-sauce-labs-backpack)
      - clickByCSS(a.shopping_cart_link)
      - clickByID(user-name)
      - typeByID(user-name): "standard_use"
      - clickByID(password)
      - clickByID(user-name)
      - typeByID(user-name): "standard_user"
      - clickByID(password)
      - typeByID(password): "secrewt_sauce"
      - keysByID(password): KEY_ENTER
      - typeSecretByID(password): "secrewt_sauce"
      - clickByCSS(div.login_password)
      - clickByCSS(div.login_password)
      - doubleClickByCSS(div.login_password)
      - clickByID(password)
      - clickByID(password)
      - doubleClickByID(password)
      - typeSecretByID(password): "secret_sauce"
      - clickByID(login-button)
      - clickByXPath(//*[text() = "1"])

  login-Http:
    headers:
      sec-ch-ua-platform: '"Windows"'
      User-Agent: >-
        Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML,
        like Gecko) Chrome/129.0.0.0 Safari/537.36
      sec-ch-ua: '"Google Chrome";v="129", "Not=A?Brand";v="8", "Chromium";v="129"'
      Content-Type: text/plain;charset=UTF-8
      sec-ch-ua-mobile: '?0'
      Accept: '*/*'
      Sec-Fetch-Site: cross-site
      Sec-Fetch-Mode: cors
      Sec-Fetch-Dest: empty
      dnt: '1'
      sec-gpc: '1'
    requests:
      - transaction: Test
        force-parent-sample: false
        do:
          - url: >-
              https://gc.kis.v2.scr.kaspersky-labs.com/1116EFB5-5A90-4B4B-9A23-98ED51C27D6F/1AF03D23-3263-4C41-B56C-791E19E171E5/to/wsm.sessionActivated?tm=2024-10-04T21%3A38%3A46.582Z
            method: POST
            label: >-
              https://gc.kis.v2.scr.kaspersky-labs.com/1116EFB5-5A90-4B4B-9A23-98ED51C27D6F/1AF03D23-3263-4C41-B56C-791E19E171E5/to/wsm.sessionActivated?tm=2024-10-04T21%3A38%3A46.582Z
            headers: {}
            body: >-
              {"result":0,"method":"wsm.sessionActivated","parameters":"{\"title\":\"Swag
              Labs\"}"}
          - url: >-
              https://gc.kis.v2.scr.kaspersky-labs.com/1116EFB5-5A90-4B4B-9A23-98ED51C27D6F/1AF03D23-3263-4C41-B56C-791E19E171E5/to/wsm.onHashChange?tm=2024-10-04T21%3A38%3A56.058Z
            method: POST
            label: >-
              https://gc.kis.v2.scr.kaspersky-labs.com/1116EFB5-5A90-4B4B-9A23-98ED51C27D6F/1AF03D23-3263-4C41-B56C-791E19E171E5/to/wsm.onHashChange?tm=2024-10-04T21%3A38%3A56.058Z
            headers: {}
            body: >-
              {"result":0,"method":"wsm.onHashChange","parameters":"{\"newLocationUrl\":\"aHR0cHM6Ly93d3cuc2F1Y2VkZW1vLmNvbS8=\",\"urlEncrypted\":true}"}
          - url: >-
              https://gc.kis.v2.scr.kaspersky-labs.com/1116EFB5-5A90-4B4B-9A23-98ED51C27D6F/1AF03D23-3263-4C41-B56C-791E19E171E5/to/wsm.onHashChange?tm=2024-10-04T21%3A38%3A56.058Z
            method: POST
            label: >-
              https://gc.kis.v2.scr.kaspersky-labs.com/1116EFB5-5A90-4B4B-9A23-98ED51C27D6F/1AF03D23-3263-4C41-B56C-791E19E171E5/to/wsm.onHashChange?tm=2024-10-04T21%3A38%3A56.058Z
            headers: {}
            body: >-
              {"result":0,"method":"wsm.onHashChange","parameters":"{\"newLocationUrl\":\"aHR0cHM6Ly93d3cuc2F1Y2VkZW1vLmNvbS8=\",\"urlEncrypted\":true}"}
          - url: >-
              https://gc.kis.v2.scr.kaspersky-labs.com/1116EFB5-5A90-4B4B-9A23-98ED51C27D6F/1AF03D23-3263-4C41-B56C-791E19E171E5/to/dp.onGetFields?tm=2024-10-04T21%3A38%3A59.144Z
            method: POST
            label: >-
              https://gc.kis.v2.scr.kaspersky-labs.com/1116EFB5-5A90-4B4B-9A23-98ED51C27D6F/1AF03D23-3263-4C41-B56C-791E19E171E5/to/dp.onGetFields?tm=2024-10-04T21%3A38%3A59.144Z
            headers: {}
            body: >-
              {"result":0,"method":"dp.onGetFields","parameters":"{\"dom\":\"<body><noscript>You
              need to enable JavaScript to run this app.</noscript><div
              id=\\\"root\\\"><div class=\\\"login_container\\\"><div
              class=\\\"login_logo\\\">Swag Labs</div><div
              class=\\\"login_wrapper\\\" data-test=\\\"login-container\\\"><div
              class=\\\"login_wrapper-inner\\\"><div
              id=\\\"login_button_container\\\" class=\\\"form_column\\\"><div
              class=\\\"login-box\\\"><form><div class=\\\"form_group\\\"><input
              class=\\\"input_error form_input error\\\"
              placeholder=\\\"Username\\\" type=\\\"text\\\"
              data-test=\\\"username\\\" id=\\\"user-name\\\"
              name=\\\"user-name\\\" autocorrect=\\\"off\\\"
              autocapitalize=\\\"none\\\" value=\\\"\\\" wfd-id=\\\"id3\\\"><svg
              aria-hidden=\\\"true\\\" focusable=\\\"false\\\"
              data-prefix=\\\"fas\\\" data-icon=\\\"times-circle\\\"
              class=\\\"svg-inline--fa fa-times-circle fa-w-16 error_icon\\\"
              role=\\\"img\\\" xmlns=\\\"http://www.w3.org/2000/svg\\\"
              viewBox=\\\"0 0 512 512\\\"><path fill=\\\"currentColor\\\"
              d=\\\"M256 8C119 8 8 119 8 256s111 248 248 248 248-111 248-248S393
              8 256 8zm121.6 313.1c4.7 4.7 4.7 12.3 0 17L338 377.6c-4.7 4.7-12.3
              4.7-17 0L256 312l-65.1 65.6c-4.7 4.7-12.3 4.7-17 0L134.4
              338c-4.7-4.7-4.7-12.3 0-17l65.6-65-65.6-65.1c-4.7-4.7-4.7-12.3
              0-17l39.6-39.6c4.7-4.7 12.3-4.7 17 0l65 65.7 65.1-65.6c4.7-4.7
              12.3-4.7 17 0l39.6 39.6c4.7 4.7 4.7 12.3 0 17L312 256l65.6
              65.1z\\\"></path></svg></div><div class=\\\"form_group\\\"><input
              class=\\\"input_error form_input error\\\"
              placeholder=\\\"Password\\\" type=\\\"password\\\"
              data-test=\\\"password\\\" id=\\\"password\\\"
              name=\\\"password\\\" autocorrect=\\\"off\\\"
              autocapitalize=\\\"none\\\" value=\\\"\\\" wfd-id=\\\"id4\\\"><svg
              aria-hidden=\\\"true\\\" focusable=\\\"false\\\"
              data-prefix=\\\"fas\\\" data-icon=\\\"times-circle\\\"
              class=\\\"svg-inline--fa fa-times-circle fa-w-16 error_icon\\\"
              role=\\\"img\\\" xmlns=\\\"http://www.w3.org/2000/svg\\\"
              viewBox=\\\"0 0 512 512\\\"><path fill=\\\"currentColor\\\"
              d=\\\"M256 8C119 8 8 119 8 256s111 248 248 248 248-111 248-248S393
              8 256 8zm121.6 313.1c4.7 4.7 4.7 12.3 0 17L338 377.6c-4.7 4.7-12.3
              4.7-17 0L256 312l-65.1 65.6c-4.7 4.7-12.3 4.7-17 0L134.4
              338c-4.7-4.7-4.7-12.3 0-17l65.6-65-65.6-65.1c-4.7-4.7-4.7-12.3
              0-17l39.6-39.6c4.7-4.7 12.3-4.7 17 0l65 65.7 65.1-65.6c4.7-4.7
              12.3-4.7 17 0l39.6 39.6c4.7 4.7 4.7 12.3 0 17L312 256l65.6
              65.1z\\\"></path></svg></div><div
              class=\\\"error-message-container error\\\"><h3
              data-test=\\\"error\\\"><button class=\\\"error-button\\\"
              data-test=\\\"error-button\\\"><svg aria-hidden=\\\"true\\\"
              focusable=\\\"false\\\" data-prefix=\\\"fas\\\"
              data-icon=\\\"times\\\" class=\\\"svg-inline--fa fa-times fa-w-11
              \\\" role=\\\"img\\\" xmlns=\\\"http://www.w3.org/2000/svg\\\"
              viewBox=\\\"0 0 352 512\\\"><path fill=\\\"currentColor\\\"
              d=\\\"M242.72 256l100.07-100.07c12.28-12.28 12.28-32.19
              0-44.48l-22.24-22.24c-12.28-12.28-32.19-12.28-44.48 0L176 189.28
              75.93 89.21c-12.28-12.28-32.19-12.28-44.48 0L9.21 111.45c-12.28
              12.28-12.28 32.19 0 44.48L109.28 256 9.21 356.07c-12.28
              12.28-12.28 32.19 0 44.48l22.24 22.24c12.28 12.28 32.2 12.28 44.48
              0L176 322.72l100.07 100.07c12.28 12.28 32.2 12.28 44.48
              0l22.24-22.24c12.28-12.28 12.28-32.19 0-44.48L242.72
              256z\\\"></path></svg></button>Epic sadface: You can only access
              '/cart.html' when you are logged in.</h3></div><input
              type=\\\"submit\\\" class=\\\"submit-button btn_action\\\"
              data-test=\\\"login-button\\\" id=\\\"login-button\\\"
              name=\\\"login-button\\\" value=\\\"Login\\\"
              wfd-id=\\\"id5\\\"></form></div></div></div><div
              class=\\\"login_credentials_wrap\\\"
              data-test=\\\"login-credentials-container\\\"><div
              class=\\\"login_credentials_wrap-inner\\\"><div
              id=\\\"login_credentials\\\" class=\\\"login_credentials\\\"
              data-test=\\\"login-credentials\\\"><h4>Accepted usernames
              are:</h4>standard_user<br>locked_out_user<br>problem_user<br>performance_glitch_user<br>error_user<br>visual_user<br></div><div
              class=\\\"login_password\\\"
              data-test=\\\"login-password\\\"><h4>Password for all
              users:</h4>secret_sauce</div></div></div></div></div></div><script
              wfd-invisible=\\\"true\\\">!function(e){function r(r){for(var
              n,p,l=r[0],a=r[1],f=r[2],c=0,s=[];c<l.length;c++)p=l[c],Object.prototype.hasOwnProperty.call(o,p)&&o[p]&&s.push(o[p][0]),o[p]=0;for(n
              in
              a)Object.prototype.hasOwnProperty.call(a,n)&&(e[n]=a[n]);for(i&&i(r);s.length;)s.shift()();return
              u.push.apply(u,f||[]),t()}function t(){for(var
              e,r=0;r<u.length;r++){for(var t=u[r],n=!0,l=1;l<t.length;l++){var
              a=t[l];0!==o[a]&&(n=!1)}n&&(u.splice(r--,1),e=p(p.s=t[0]))}return
              e}var n={},o={1:0},u=[];function p(r){if(n[r])return
              n[r].exports;var t=n[r]={i:r,l:!1,exports:{}};return
              e[r].call(t.exports,t,t.exports,p),t.l=!0,t.exports}p.m=e,p.c=n,p.d=function(e,r,t){p.o(e,r)||Object.defineProperty(e,r,{enumerable:!0,get:t})},p.r=function(e){\\\"undefined\\\"!=typeof
              Symbol&&Symbol.toStringTag&&Object.defineProperty(e,Symbol.toStringTag,{value:\\\"Module\\\"}),Object.defineProperty(e,\\\"__esModule\\\",{value:!0})},p.t=function(e,r){if(1&r&&(e=p(e)),8&r)return
              e;if(4&r&&\\\"object\\\"==typeof e&&e&&e.__esModule)return e;var
              t=Object.create(null);if(p.r(t),Object.defineProperty(t,\\\"default\\\",{enumerable:!0,value:e}),2&r&&\\\"string\\\"!=typeof
              e)for(var n in e)p.d(t,n,function(r){return
              e[r]}.bind(null,n));return t},p.n=function(e){var
              r=e&&e.__esModule?function(){return e.default}:function(){return
              e};return p.d(r,\\\"a\\\",r),r},p.o=function(e,r){return
              Object.prototype.hasOwnProperty.call(e,r)},p.p=\\\"/\\\";var
              l=this[\\\"webpackJsonpsample-app-web\\\"]=this[\\\"webpackJsonpsample-app-web\\\"]||[],a=l.push.bind(l);l.push=r,l=l.slice();for(var
              f=0;f<l.length;f++)r(l[f]);var i=a;t()}([])</script><script
              src=\\\"/static/js/2.84a5cbf3.chunk.js\\\"
              wfd-invisible=\\\"true\\\"></script><script
              src=\\\"/static/js/main.018d2d1e.chunk.js\\\"
              wfd-invisible=\\\"true\\\"></script></body>\"}"}
          - url: >-
              https://gc.kis.v2.scr.kaspersky-labs.com/1116EFB5-5A90-4B4B-9A23-98ED51C27D6F/1AF03D23-3263-4C41-B56C-791E19E171E5/to/wsm.onHashChange?tm=2024-10-04T21%3A39%3A17.885Z
            method: POST
            label: >-
              https://gc.kis.v2.scr.kaspersky-labs.com/1116EFB5-5A90-4B4B-9A23-98ED51C27D6F/1AF03D23-3263-4C41-B56C-791E19E171E5/to/wsm.onHashChange?tm=2024-10-04T21%3A39%3A17.885Z
            headers: {}
            body: >-
              {"result":0,"method":"wsm.onHashChange","parameters":"{\"newLocationUrl\":\"aHR0cHM6Ly93d3cuc2F1Y2VkZW1vLmNvbS9pbnZlbnRvcnkuaHRtbA==\",\"urlEncrypted\":true}"}
          - url: >-
              https://gc.kis.v2.scr.kaspersky-labs.com/1116EFB5-5A90-4B4B-9A23-98ED51C27D6F/1AF03D23-3263-4C41-B56C-791E19E171E5/to/wsm.sessionDeactivated?tm=2024-10-04T21%3A39%3A19.139Z
            method: POST
            label: >-
              https://gc.kis.v2.scr.kaspersky-labs.com/1116EFB5-5A90-4B4B-9A23-98ED51C27D6F/1AF03D23-3263-4C41-B56C-791E19E171E5/to/wsm.sessionDeactivated?tm=2024-10-04T21%3A39%3A19.139Z
            headers: {}
            body: >-
              {"result":0,"method":"wsm.sessionDeactivated","parameters":"{\"title\":\"Swag
              Labs\"}"}
          - url: >-
              https://gc.kis.v2.scr.kaspersky-labs.com/1116EFB5-5A90-4B4B-9A23-98ED51C27D6F/1AF03D23-3263-4C41-B56C-791E19E171E5/to/wsm.sessionActivated?tm=2024-10-04T21%3A39%3A20.167Z
            method: POST
            label: >-
              https://gc.kis.v2.scr.kaspersky-labs.com/1116EFB5-5A90-4B4B-9A23-98ED51C27D6F/1AF03D23-3263-4C41-B56C-791E19E171E5/to/wsm.sessionActivated?tm=2024-10-04T21%3A39%3A20.167Z
            headers: {}
            body: >-
              {"result":0,"method":"wsm.sessionActivated","parameters":"{\"title\":\"Swag
              Labs\"}"}
          - url: >-
              https://gc.kis.v2.scr.kaspersky-labs.com/1116EFB5-5A90-4B4B-9A23-98ED51C27D6F/1AF03D23-3263-4C41-B56C-791E19E171E5/to/wsm.onHashChange?tm=2024-10-04T21%3A39%3A21.640Z
            method: POST
            label: >-
              https://gc.kis.v2.scr.kaspersky-labs.com/1116EFB5-5A90-4B4B-9A23-98ED51C27D6F/1AF03D23-3263-4C41-B56C-791E19E171E5/to/wsm.onHashChange?tm=2024-10-04T21%3A39%3A21.640Z
            headers: {}
            body: >-
              {"result":0,"method":"wsm.onHashChange","parameters":"{\"newLocationUrl\":\"aHR0cHM6Ly93d3cuc2F1Y2VkZW1vLmNvbS9jYXJ0Lmh0bWw=\",\"urlEncrypted\":true}"}